{
  "backend/main.mo": "Minimal Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping portfolio requirements to related source files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for each frontend source file in the project.",
  "frontend/index.css": "Tailwind base/style setup defining color tokens, dark theme variables, and global body/border styling.",
  "frontend/index.html": "Base HTML file that loads the React app via main.tsx with a root mounting point.",
  "frontend/src/App.tsx": "Main React component enabling dark mode and rendering all portfolio sections with navigation and footer.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text and a caffeine.ai attribution link with tracking parameters.",
  "frontend/src/components/ProjectCard.tsx": "Reusable card component showing a project’s image, tools, problem, approach, and key outcomes.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section with themed contact cards and a CTA, using configurable color classes.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Displays a career experience timeline with two roles and achievements via a Timeline component.",
  "frontend/src/components/sections/HeroSection.tsx": "Builds a hero banner with background image, intro text, skill highlights, and buttons that smooth-scroll to sections.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows a portfolio section rendering multiple detailed project cards with problems, approaches, and outcomes.",
  "frontend/src/components/sections/SkillsSection.tsx": "Renders categorized skill cards with icons and color themes for technical and analytical competencies.",
  "frontend/src/components/Timeline.tsx": "Timeline component rendering experience entries with period, company, description, and achievements.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation bar with smooth scrolling, scroll-based styling, and a responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth using AuthClient, including login, logout, and status state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the static portfolio.",
  "frontend/src/index.css": "Defines Tailwind base styles, theming variables, dark mode colors, utilities, and custom scroll and gradient styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, utilities, and enabling plugins like typography and container queries.",
  "project_state.json": "Describes the portfolio project's state, features, requirements, images, and metadata for the React dark‑theme data analyst site."
}