{
  "kind": "build_request",
  "title": "Professional dark-theme Data Analyst portfolio (React) with skills, projects, experience, and contact",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a single-page portfolio layout with clear top navigation (e.g., Home, Skills, Projects, Experience, Contact) and smooth in-page scrolling to each section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The website includes:\n\nHero section with professional introduction\nSkills showcase with your core competencies\nProjects section featuring sample data analysis work\nExperience timeline\nContact information\nResponsive design that looks great on all devices"
        ]
      },
      "acceptanceCriteria": [
        "Navigation is visible on desktop and usable on mobile (collapsible menu or compact layout).",
        "Each nav item scrolls to the correct section with consistent spacing and no content hidden under the header.",
        "All sections are present: Hero, Skills, Projects, Experience Timeline, Contact."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a modern dark theme with a cohesive, professional visual style suitable for a data analyst portfolio (typography, spacing, and a restrained accent palette such as charcoal + teal + amber). Apply consistently across all sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The portfolio features a modern dark theme with beautiful data visualization imagery"
        ]
      },
      "acceptanceCriteria": [
        "Backgrounds, text, and surfaces meet accessible contrast in dark mode.",
        "Buttons/links/hover states follow one consistent accent color system.",
        "All sections share consistent typography scale, grid/spacing, and component styling."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Build the Hero section with a professional introduction that explicitly highlights 2+ years of experience and key tools/skills: R, Power BI, SQL, Python, data visualization, statistical analysis. Include a clear call-to-action to view projects and contact details.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hero section with professional introduction",
          "highlights your 2 + years of experience with R programming, Power BI, and SQL, python, data visualization, statistical analysis"
        ]
      },
      "acceptanceCriteria": [
        "Hero contains a headline, short summary paragraph, and at least two CTAs (e.g., “View Projects”, “Contact”).",
        "Hero text includes: 2+ years experience, and mentions R, Power BI, SQL, Python.",
        "Hero layout is responsive (text and imagery remain readable on small screens)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create a Skills section that showcases core competencies and tools with a clean, scannable layout (e.g., grouped chips/cards for Tools, Analysis Methods, Visualization, Data).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Skills showcase with your core competencies"
        ]
      },
      "acceptanceCriteria": [
        "Skills are grouped into logical categories (at minimum Tools and Core Competencies).",
        "Skills list includes R, Power BI, SQL, Python, data visualization, statistical analysis.",
        "Skills UI is responsive and maintains consistent spacing and alignment."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create a Projects section featuring at least 3 sample data analysis projects/case studies. Each project card should include: title, short problem statement, approach, tools used, and outcomes/insights (using realistic placeholder content).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Projects section featuring sample data analysis work"
        ]
      },
      "acceptanceCriteria": [
        "At least 3 projects are displayed as cards or rows with consistent formatting.",
        "Each project shows title, problem, approach, tools, and outcome.",
        "Projects are readable on mobile (no horizontal overflow; cards stack properly)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement an Experience timeline section that communicates professional progression over 2+ years, with roles/periods and bullet-point impact statements (realistic placeholder content).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Experience timeline",
          "highlights your 2 + years of experience"
        ]
      },
      "acceptanceCriteria": [
        "Timeline shows at least 2 entries with dates/periods and role titles.",
        "Each entry includes 2–4 impact-focused bullet points (metrics-oriented where possible, as placeholder).",
        "Timeline layout adapts for mobile (vertical stacking or simplified timeline)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Create a Contact section that displays contact information (email and at least one additional channel such as LinkedIn/GitHub/portfolio link) using safe placeholders in English and a polished layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Contact information"
        ]
      },
      "acceptanceCriteria": [
        "Contact section includes email plus at least one additional contact link (placeholders are acceptable).",
        "Links are clearly styled and accessible (keyboard focus visible).",
        "Contact section renders well on mobile and desktop."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Incorporate beautiful data-visualization-themed imagery throughout the page (e.g., hero background/illustration and project thumbnails) using locally bundled static assets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "beautiful data visualization imagery"
        ]
      },
      "acceptanceCriteria": [
        "At least one data-viz hero image and at least three project images are displayed.",
        "Images are loaded as static assets (not fetched from backend).",
        "Images are responsive (proper sizing, no distortion, appropriate object-fit)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add and render the generated images as static files under frontend/public/assets/generated and reference them from the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "All required generated images exist at frontend/public/assets/generated.",
        "UI references images via static paths (e.g., /assets/generated/...).",
        "Build runs without missing-asset errors."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Ensure fully responsive design across common breakpoints (mobile, tablet, desktop) with no layout overflow, readable typography, and touch-friendly interactions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Responsive design that looks great on all devices"
        ]
      },
      "acceptanceCriteria": [
        "No horizontal scrolling on mobile at typical widths (e.g., 375px).",
        "Navigation, cards, and timeline are usable via touch on mobile.",
        "Typography and spacing scale appropriately between mobile and desktop."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Do not edit any files under frontend/src/components/ui or other immutable paths defined by the system.",
    "Do not introduce non-supported technologies (no Next.js, no external databases, no third-party auth beyond Internet Identity, no WebSockets).",
    "Backend must remain a single Motoko actor if any backend changes are needed (prefer frontend-only for this portfolio)."
  ],
  "nonGoals": [
    "Building a CMS or admin panel for editing portfolio content.",
    "Implementing third-party analytics, email delivery, or contact-form submission via external services.",
    "Adding authentication flows (Internet Identity) unless explicitly requested.",
    "Integrating external APIs for live data dashboards."
  ],
  "imageRequirements": {
    "required": [
      "Abstract dark data-visualization hero background with subtle charts/grids (hero-dataviz-bg.dim_1920x1080.png)",
      "Minimalist data dashboard illustration in dark theme (dashboard-illustration.dim_1200x800.png)",
      "Project thumbnail: sales performance chart collage in dark theme (project-sales-thumb.dim_800x600.png)",
      "Project thumbnail: churn/cohort analysis visualization in dark theme (project-churn-thumb.dim_800x600.png)",
      "Project thumbnail: A/B test results and KPI tiles in dark theme (project-abtest-thumb.dim_800x600.png)"
    ],
    "edits": []
  }
}