{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Professional dark-theme Data Analyst portfolio (React) — single-page sections with static data-viz imagery",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Single-page portfolio with top navigation and smooth in-page scrolling to Hero, Skills, Projects, Experience, Contact.",
      "acceptanceCriteria": [
        "Navigation is visible on desktop and usable on mobile (collapsible menu or compact layout).",
        "Each nav item scrolls to the correct section with consistent spacing and no content hidden under the header.",
        "All sections are present: Hero, Skills, Projects, Experience Timeline, Contact."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the single-page layout and wire all required sections (Hero, Skills, Projects, Experience, Contact) into one scrollable page; implement in-page anchors and smooth scroll behavior with header-safe offsets (e.g., section scroll margin)."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "create",
          "description": "Implement a sticky top navigation with desktop links and a mobile-friendly collapsible menu; clicking items scrolls to section anchors without hiding content under the header."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "create",
          "description": "Create the Hero section component and ensure it is wired into the main single-page layout (not an orphan component)."
        },
        {
          "path": "frontend/src/components/sections/SkillsSection.tsx",
          "operation": "create",
          "description": "Create the Skills section component and ensure it is wired into the main single-page layout (not an orphan component)."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "create",
          "description": "Create the Projects section component and ensure it is wired into the main single-page layout (not an orphan component)."
        },
        {
          "path": "frontend/src/components/sections/ExperienceSection.tsx",
          "operation": "create",
          "description": "Create the Experience Timeline section component and ensure it is wired into the main single-page layout (not an orphan component)."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "create",
          "description": "Create the Contact section component and ensure it is wired into the main single-page layout (not an orphan component)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Modern, cohesive dark theme (charcoal + teal + amber accents) applied consistently across the portfolio.",
      "acceptanceCriteria": [
        "Backgrounds, text, and surfaces meet accessible contrast in dark mode.",
        "Buttons/links/hover states follow one consistent accent color system.",
        "All sections share consistent typography scale, grid/spacing, and component styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Define global dark-theme styling using the existing Tailwind + CSS variable approach (set background/foreground/surface and a restrained accent palette such as charcoal + teal + amber); include consistent typography and spacing defaults and enable smooth scrolling globally."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the app renders in dark mode by default (e.g., applying the dark class at the top-level wrapper) and uses consistent container/grid spacing across sections."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Hero section with professional intro highlighting 2+ years experience and key tools/skills, plus CTAs to Projects and Contact.",
      "acceptanceCriteria": [
        "Hero contains a headline, short summary paragraph, and at least two CTAs (e.g., “View Projects”, “Contact”).",
        "Hero text includes: 2+ years experience, and mentions R, Power BI, SQL, Python.",
        "Hero layout is responsive (text and imagery remain readable on small screens)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Implement hero content in English: headline + summary explicitly mentioning 2+ years and the tools (R, Power BI, SQL, Python) plus data visualization and statistical analysis; add at least two CTAs that scroll to Projects and Contact sections; ensure responsive layout with imagery."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Wire nav interactions so Hero CTAs and top nav can target the correct in-page anchors consistently."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Skills section with grouped, scannable categories for tools and core competencies.",
      "acceptanceCriteria": [
        "Skills are grouped into logical categories (at minimum Tools and Core Competencies).",
        "Skills list includes R, Power BI, SQL, Python, data visualization, statistical analysis.",
        "Skills UI is responsive and maintains consistent spacing and alignment."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/SkillsSection.tsx",
          "operation": "modify",
          "description": "Implement grouped skill categories (at minimum Tools and Core Competencies) using a clean chip/card layout; include R, Power BI, SQL, Python, data visualization, statistical analysis; ensure responsive wrapping and consistent spacing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Projects section with at least 3 sample data analysis case studies displayed as consistent cards/rows.",
      "acceptanceCriteria": [
        "At least 3 projects are displayed as cards or rows with consistent formatting.",
        "Each project shows title, problem, approach, tools, and outcome.",
        "Projects are readable on mobile (no horizontal overflow; cards stack properly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Add realistic English placeholder content for at least three projects; each project includes title, short problem statement, approach, tools used, and outcomes/insights; implement a responsive card/grid layout that stacks on small screens."
        },
        {
          "path": "frontend/src/components/ProjectCard.tsx",
          "operation": "create",
          "description": "Create a reusable ProjectCard component to ensure consistent formatting across all project entries and to support project thumbnail imagery."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Experience timeline section showing professional progression over 2+ years with impact bullets.",
      "acceptanceCriteria": [
        "Timeline shows at least 2 entries with dates/periods and role titles.",
        "Each entry includes 2–4 impact-focused bullet points (metrics-oriented where possible, as placeholder).",
        "Timeline layout adapts for mobile (vertical stacking or simplified timeline)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ExperienceSection.tsx",
          "operation": "modify",
          "description": "Implement an experience timeline with at least two entries, each with a period/date range, role title, and 2–4 metrics-oriented impact bullets (English placeholders); ensure mobile-friendly vertical layout."
        },
        {
          "path": "frontend/src/components/Timeline.tsx",
          "operation": "create",
          "description": "Create a simple Timeline component to standardize timeline item spacing, markers, and responsive behavior for the Experience section."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Contact section with email plus at least one additional channel link, styled accessibly.",
      "acceptanceCriteria": [
        "Contact section includes email plus at least one additional contact link (placeholders are acceptable).",
        "Links are clearly styled and accessible (keyboard focus visible).",
        "Contact section renders well on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Implement a polished Contact section in English that includes a safe placeholder email and at least one additional channel (e.g., LinkedIn or GitHub); ensure accessible link styling with visible focus states and responsive layout."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global focus-visible styles and consistent link/button hover styles aligned to the chosen accent palette to support accessible navigation in the Contact section and across the page."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Use locally bundled data-visualization-themed imagery (hero background/illustration and project thumbnails) throughout the page.",
      "acceptanceCriteria": [
        "At least one data-viz hero image and at least three project images are displayed.",
        "Images are loaded as static assets (not fetched from backend).",
        "Images are responsive (proper sizing, no distortion, appropriate object-fit)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Reference and render the hero data-viz imagery as locally bundled static assets (use frontend/public/assets/generated/hero-dataviz-bg.dim_1920x1080.png and frontend/public/assets/generated/dashboard-illustration.dim_1200x800.png) with responsive sizing and appropriate object-fit."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Display at least three locally bundled project thumbnails on project cards (use frontend/public/assets/generated/project-sales-thumb.dim_800x600.png, frontend/public/assets/generated/project-churn-thumb.dim_800x600.png, frontend/public/assets/generated/project-abtest-thumb.dim_800x600.png) with responsive sizing and no distortion."
        },
        {
          "path": "frontend/src/components/ProjectCard.tsx",
          "operation": "modify",
          "description": "Add thumbnail rendering support (alt text, sizing, and object-fit) so project images remain readable and undistorted across breakpoints."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add required generated images under frontend/public/assets/generated and reference them from the UI as static assets.",
      "acceptanceCriteria": [
        "All required generated images exist at frontend/public/assets/generated.",
        "UI references images via static paths (e.g., /assets/generated/...).",
        "Build runs without missing-asset errors."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/hero-dataviz-bg.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated image file to the required static assets directory so the UI can reference it without backend fetching."
        },
        {
          "path": "frontend/public/assets/generated/dashboard-illustration.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated image file to the required static assets directory so the UI can reference it without backend fetching."
        },
        {
          "path": "frontend/public/assets/generated/project-sales-thumb.dim_800x600.png",
          "operation": "create",
          "description": "Add the generated image file to the required static assets directory so the UI can reference it without backend fetching."
        },
        {
          "path": "frontend/public/assets/generated/project-churn-thumb.dim_800x600.png",
          "operation": "create",
          "description": "Add the generated image file to the required static assets directory so the UI can reference it without backend fetching."
        },
        {
          "path": "frontend/public/assets/generated/project-abtest-thumb.dim_800x600.png",
          "operation": "create",
          "description": "Add the generated image file to the required static assets directory so the UI can reference it without backend fetching."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure Hero references the exact generated image filenames from frontend/public/assets/generated (hero-dataviz-bg.dim_1920x1080.png and dashboard-illustration.dim_1200x800.png) using static asset paths, so builds do not fail due to missing assets."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Ensure Projects references the exact generated image filenames from frontend/public/assets/generated (project-sales-thumb.dim_800x600.png, project-churn-thumb.dim_800x600.png, project-abtest-thumb.dim_800x600.png) using static asset paths, so builds do not fail due to missing assets."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Ensure fully responsive design (mobile/tablet/desktop) with no overflow, readable typography, and touch-friendly interactions.",
      "acceptanceCriteria": [
        "No horizontal scrolling on mobile at typical widths (e.g., 375px).",
        "Navigation, cards, and timeline are usable via touch on mobile.",
        "Typography and spacing scale appropriately between mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Finalize responsive navigation behavior (collapsible menu, adequate tap targets, and no overflow) across common breakpoints."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Ensure project cards/grid have responsive columns, wrap correctly on small screens, and never cause horizontal overflow."
        },
        {
          "path": "frontend/src/components/sections/ExperienceSection.tsx",
          "operation": "modify",
          "description": "Ensure the timeline layout gracefully stacks/simplifies on mobile with readable spacing and no overflow."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Set responsive typography defaults and safe layout rules (e.g., max-width behaviors for images/media, consistent section padding) to prevent horizontal scrolling and maintain readability across breakpoints."
        }
      ]
    }
  ]
}